w-dee/s3-hidbot/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# The firmware targets a conservative 4 MiB flash minimum; the FNK0085
# fixture's additional flash capacity is intentionally not required.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# External PSRAM is deliberately optional hardware, not a firmware requirement.
# CONFIG_SPIRAM is not set
CONFIG_TINYUSB_HID_COUNT=2
CONFIG_TINYUSB_SUSPEND_CALLBACK=y
CONFIG_TINYUSB_RESUME_CALLBACK=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_GATT_SERVER=y
# CONFIG_BT_NIMBLE_GATT_CLIENT is not set
# CONFIG_BLE_MESH is not set
